In [1]:
students = {"name":["majid","ali","reza","sara","hasan","mohammad","ahmad","maryam","mina","sahar"],
            "math score":[12,5,18,16.5,7,17,19,13,6,8],
            "computer score":[18,12,15,18.5,9,10,20,14,7,6],
            "Gender":["Male","Male","Male","Female","Male","Male","Male","Female","Female","Female"],
            "Guest":[True,True,False,False,False,False,False,True,True,False],
            "city":["Tehran","Tehran","Mashhad","Yazd","Shiraz","Tehran","Mashhad", "Yazd","Karaj","Tehran"]}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(students)

In [4]:
df

       name  math score  computer score  Gender  Guest     city
0     majid        12.0            18.0    Male   True   Tehran
1       ali         5.0            12.0    Male   True   Tehran
2      reza        18.0            15.0    Male  False  Mashhad
3      sara        16.5            18.5  Female  False     Yazd
4     hasan         7.0             9.0    Male  False   Shiraz
5  mohammad        17.0            10.0    Male  False   Tehran
6     ahmad        19.0            20.0    Male  False  Mashhad
7    maryam        13.0            14.0  Female   True     Yazd
8      mina         6.0             7.0  Female   True    Karaj
9     sahar         8.0             6.0  Female  False   Tehran

In [5]:
df.columns

Index(['name', 'math score', 'computer score', 'Gender', 'Guest', 'city'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
df["name"] # or df.name

0       majid
1         ali
2        reza
3        sara
4       hasan
5    mohammad
6       ahmad
7      maryam
8        mina
9       sahar
Name: name, dtype: object

In [11]:
df["math score"] # not df.math score

0    12.0
1     5.0
2    18.0
3    16.5
4     7.0
5    17.0
6    19.0
7    13.0
8     6.0
9     8.0
Name: math score, dtype: float64

In [13]:
type(df["math score"])

pandas.core.series.Series

In [ ]:
# df.iloc
# df.loc

# کار با متد iloc

In [15]:
# df.iloc[ rows_numbers , columns_numbers]
# integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array
df.iloc[0,0]

'majid'

In [21]:
# df.iloc[0,"name"] Error
df.iloc[:3, :]
df.iloc[-3:,[0,-1]]

     name    city
7  maryam    Yazd
8    mina   Karaj
9   sahar  Tehran

In [22]:
df.iloc[[True,True,False,False,False,False,False,False,False,False],:]

    name  math score  computer score Gender  Guest    city
0  majid        12.0            18.0   Male   True  Tehran
1    ali         5.0            12.0   Male   True  Tehran

In [25]:
df.iloc[[True,True,False,False,False,False,False,False,False,False],[0,1,2,3,4,5]]

    name  math score  computer score Gender  Guest    city
0  majid        12.0            18.0   Male   True  Tehran
1    ali         5.0            12.0   Male   True  Tehran

In [30]:
df.iloc[:3, :3]

    name  math score  computer score
0  majid        12.0            18.0
1    ali         5.0            12.0
2   reza        18.0            15.0

# کار کردن با متد loc

In [26]:
df.columns

Index(['name', 'math score', 'computer score', 'Gender', 'Guest', 'city'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [28]:
# df.loc[ rows_label , columns_labe ]
df.loc[0, "name"]

'majid'

In [29]:
df.loc[0:5, "name":"computer score"]

       name  math score  computer score
0     majid        12.0            18.0
1       ali         5.0            12.0
2      reza        18.0            15.0
3      sara        16.5            18.5
4     hasan         7.0             9.0
5  mohammad        17.0            10.0

In [31]:
df.loc[[0,1,2], ["name","Gender"]]

    name Gender
0  majid   Male
1    ali   Male
2   reza   Male

In [33]:
df.loc[[True,True,False,False,False,False,False,False,False,False],[True,True,False,False,False,False]]

    name  math score
0  majid        12.0
1    ali         5.0